In [1]:
import numpy as np
import pandas as pd

In [3]:
data={'Name': ['Ram','Jack','Roy','John','Michael','Maya','Ravi','Jay','Riya','Krish'],
     'Roll_No' : [23,12,56,1,16,20,29,41,49,51],
     'Marks':[90,67,89,76,91,56,79,88,96,49]}

In [4]:
x=pd.DataFrame(data,index=['COMP','IT','IT','COMP','MECH','COMP','IT','MECH','COMP','IT'])

In [5]:
x

         Name  Roll_No  Marks
COMP      Ram       23     90
IT       Jack       12     67
IT        Roy       56     89
COMP     John        1     76
MECH  Michael       16     91
COMP     Maya       20     56
IT       Ravi       29     79
MECH      Jay       41     88
COMP     Riya       49     96
IT      Krish       51     49

In [23]:
x.index.name='Branch'

In [24]:
x

           Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
COMP       John        1     76   Pass
MECH    Michael       16     91   Pass
COMP       Maya       20     56   Pass
IT         Ravi       29     79   Pass
MECH        Jay       41     88   Pass
COMP       Riya       49     96   Pass
IT        Krish       51     49   Pass

In [6]:
len(x)

10

In [7]:
len(x.Name)

10

In [8]:
x.head()

         Name  Roll_No  Marks
COMP      Ram       23     90
IT       Jack       12     67
IT        Roy       56     89
COMP     John        1     76
MECH  Michael       16     91

In [9]:
x.tail()

       Name  Roll_No  Marks
COMP   Maya       20     56
IT     Ravi       29     79
MECH    Jay       41     88
COMP   Riya       49     96
IT    Krish       51     49

In [10]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, COMP to IT
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Roll_No  10 non-null     int64
 2   Marks    10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [11]:
x.describe()

         Roll_No      Marks
count  10.000000  10.000000
mean   29.800000  78.100000
std    18.587929  16.017005
min     1.000000  49.000000
25%    17.000000  69.250000
50%    26.000000  83.500000
75%    47.000000  89.750000
max    56.000000  96.000000

In [13]:
x.Marks

COMP    90
IT      67
IT      89
COMP    76
MECH    91
COMP    56
IT      79
MECH    88
COMP    96
IT      49
Name: Marks, dtype: int64

In [15]:
mul=x.Roll_No*x.Marks

In [16]:
mul

COMP    2070
IT       804
IT      4984
COMP      76
MECH    1456
COMP    1120
IT      2291
MECH    3608
COMP    4704
IT      2499
dtype: int64

In [17]:
x.drop('MECH').head()

      Name  Roll_No  Marks
COMP   Ram       23     90
IT    Jack       12     67
IT     Roy       56     89
COMP  John        1     76
COMP  Maya       20     56

In [20]:
x['Result']='Pass'

In [21]:
x

         Name  Roll_No  Marks Result
COMP      Ram       23     90   Pass
IT       Jack       12     67   Pass
IT        Roy       56     89   Pass
COMP     John        1     76   Pass
MECH  Michael       16     91   Pass
COMP     Maya       20     56   Pass
IT       Ravi       29     79   Pass
MECH      Jay       41     88   Pass
COMP     Riya       49     96   Pass
IT      Krish       51     49   Pass

In [25]:
x.columns.name='X'
x

X          Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
COMP       John        1     76   Pass
MECH    Michael       16     91   Pass
COMP       Maya       20     56   Pass
IT         Ravi       29     79   Pass
MECH        Jay       41     88   Pass
COMP       Riya       49     96   Pass
IT        Krish       51     49   Pass

In [26]:
x.sort_index()

X          Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
COMP       John        1     76   Pass
COMP       Maya       20     56   Pass
COMP       Riya       49     96   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
IT         Ravi       29     79   Pass
IT        Krish       51     49   Pass
MECH    Michael       16     91   Pass
MECH        Jay       41     88   Pass

In [27]:
x.index.is_unique

False

In [28]:
x[x['Marks']>50]

X          Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
COMP       John        1     76   Pass
MECH    Michael       16     91   Pass
COMP       Maya       20     56   Pass
IT         Ravi       29     79   Pass
MECH        Jay       41     88   Pass
COMP       Riya       49     96   Pass

In [29]:
x.sum()

X
Name       RamJackRoyJohnMichaelMayaRaviJayRiyaKrish
Roll_No                                          298
Marks                                            781
Result      PassPassPassPassPassPassPassPassPassPass
dtype: object

In [31]:
x['Marks'].mean()

78.1

In [32]:
x.max()

X
Name        Roy
Roll_No      56
Marks        96
Result     Pass
dtype: object

x.min()

In [34]:
x["Marks"].median()

83.5

In [40]:
x['Marks'].idxmax()

'COMP'

In [41]:
x['Marks'].idxmin()

'IT'

In [38]:
x['Marks'].argmin()

9

In [42]:
x['Marks'].argmax()

8

In [43]:
x['Marks'].std()

16.01700485248239

In [44]:
x['Marks'].var()

256.5444444444445

In [45]:
x['Marks'].prod()

6797158652382658560

In [46]:
x['Marks'].mad()

12.88

In [47]:
x.Marks.diff()

Branch
COMP     NaN
IT     -23.0
IT      22.0
COMP   -13.0
MECH    15.0
COMP   -35.0
IT      23.0
MECH     9.0
COMP     8.0
IT     -47.0
Name: Marks, dtype: float64

In [48]:
x.cov()

X           Roll_No       Marks
X
Roll_No  345.511111   37.577778
Marks     37.577778  256.544444

In [49]:
x.corr()

X         Roll_No     Marks
X
Roll_No  1.000000  0.126217
Marks    0.126217  1.000000

In [50]:
x.corrwith(x.Marks)

X
Roll_No    0.126217
Marks      1.000000
dtype: float64

In [51]:
x.isnull()

X        Name  Roll_No  Marks  Result
Branch
COMP    False    False  False   False
IT      False    False  False   False
IT      False    False  False   False
COMP    False    False  False   False
MECH    False    False  False   False
COMP    False    False  False   False
IT      False    False  False   False
MECH    False    False  False   False
COMP    False    False  False   False
IT      False    False  False   False

In [52]:
x.dropna()

X          Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
COMP       John        1     76   Pass
MECH    Michael       16     91   Pass
COMP       Maya       20     56   Pass
IT         Ravi       29     79   Pass
MECH        Jay       41     88   Pass
COMP       Riya       49     96   Pass
IT        Krish       51     49   Pass

In [53]:
x.fillna(0)

X          Name  Roll_No  Marks Result
Branch
COMP        Ram       23     90   Pass
IT         Jack       12     67   Pass
IT          Roy       56     89   Pass
COMP       John        1     76   Pass
MECH    Michael       16     91   Pass
COMP       Maya       20     56   Pass
IT         Ravi       29     79   Pass
MECH        Jay       41     88   Pass
COMP       Riya       49     96   Pass
IT        Krish       51     49   Pass

In [54]:
x.duplicated()

Branch
COMP    False
IT      False
IT      False
COMP    False
MECH    False
COMP    False
IT      False
MECH    False
COMP    False
IT      False
dtype: bool

In [56]:
x.index

Index(['COMP', 'IT', 'IT', 'COMP', 'MECH', 'COMP', 'IT', 'MECH', 'COMP', 'IT'], dtype='object', name='Branch')

In [61]:
x.drop_duplicates('Result')

X      Name  Roll_No  Marks Result
Branch
COMP    Ram       23     90   Pass